{
    "architectures": [
      "Qwen2MoeForCausalLM"
    ],
    "auto_map": {
      "AutoModelForCausalLM": "qwen2_moe.Qwen2MoeForCausalLM",
      "AutoConfig": "qwen2_moe.Qwen2MoeConfig"
    },
    "attention_dropout": 0.0,
    "bos_token_id": 151643,
    "eos_token_id": 151643,
    "hidden_act": "silu",
    "hidden_size": CONFIG_HIDDEN_SIZE,
    "initializer_range": 0.02,
    "intermediate_size": CONFIG_INTERMEDIATE_SIZE,
    "max_position_embeddings": 32786,
    "max_window_layers": 21,
    "model_type": "qwen2",
    "num_attention_heads": CONFIG_ATTENTION_HEADS,
    "num_hidden_layers": CONFIG_HIDDEN_LAYERS,
    "num_key_value_heads": CONFIG_KV_HEADS,
    "rms_norm_eps": 1e-06,
    "rope_theta": 1000000.0,
    "sliding_window": 32768,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.37.0",
    "use_cache": true,
    "use_sliding_window": false,
    "vocab_size": 151936,
    "num_local_experts": CONFIG_NUM_EXPERTS,
    "num_experts_per_tok": CONFIG_EXPERTS_topk
  }