{
    "architectures": [
      "MixtralForCausalLM"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "hidden_act": "silu",
    "hidden_size": CONFIG_HIDDEN_SIZE,
    "initializer_range": 0.02,
    "intermediate_size": CONFIG_INTERMEDIATE_SIZE,
    "max_position_embeddings": 32768,
    "model_type": "mixtral",
    "num_attention_heads": CONFIG_ATTENTION_HEADS,
    "num_experts_per_tok": CONFIG_EXPERTS_topk,
    "num_hidden_layers": CONFIG_HIDDEN_LAYERS,
    "num_key_value_heads": CONFIG_KV_HEADS,
    "num_local_experts": CONFIG_NUM_EXPERTS,
    "rms_norm_eps": 1e-05,
    "rope_theta": 1000000.0,
    "router_aux_loss_coef": 0.02,
    "sliding_window": 4096,
    "tie_word_embeddings": false,
    "torch_dtype": "float16",
    "transformers_version": "4.36.0.dev0",
    "use_cache": true,
    "vocab_size": 32000
  }