{
    "_from_model_config": true,
    "architectures": [
      "LlamaMoeForCausalLM"
    ],
    "auto_map": {
      "AutoModelForCausalLM": "llama_moe.LlamaMoeForCausalLM",
      "AutoConfig": "llama_moe.LlamaMoeConfig"
    },
    "bos_token_id": 1,
    "eos_token_id": 2,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 11008,
    "max_position_embeddings": 4096,
    "model_type": "llama",
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "num_key_value_heads": 32,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "tie_word_embeddings": false,
    "torch_dtype": "float16",
    "transformers_version": "4.36.0.dev0",
    "use_cache": true,
    "vocab_size": 32000,
    "num_local_experts": 0,
    "num_experts_per_tok": 2
  }