{
    "architectures": [
      "LlamaMoeForCausalLM"
    ],
    "auto_map": {
      "AutoModelForCausalLM": "llama_moe.LlamaMoeForCausalLM",
      "AutoConfig": "llama_moe.LlamaMoeConfig"
    },
    "bos_token_id": 1,
    "eos_token_id": 2,
    "pad_token_id": 0,
    "hidden_act": "silu",
    "hidden_size": CONFIG_HIDDEN_SIZE,
    "initializer_range": 0.02,
    "intermediate_size": CONFIG_INTERMEDIATE_SIZE,
    "max_position_embeddings": 2048,
    "model_type": "llama",
    "num_attention_heads": CONFIG_ATTENTION_HEADS,
    "num_hidden_layers": CONFIG_HIDDEN_LAYERS,
    "num_key_value_heads": CONFIG_KV_HEADS,
    "pretraining_tp": 2,
    "rms_norm_eps": 1e-05,
    "rope_theta": CONFIG_ROPE_THETA,
    "rope_scaling": null,
    "tie_word_embeddings": false,
    "torch_dtype": "float16",
    "transformers_version": "4.36.0.dev0",
    "use_cache": true,
    "vocab_size": CONFIG_VOCAB_SIZE,
    "num_local_experts": CONFIG_NUM_EXPERTS,
    "num_experts_per_tok": CONFIG_EXPERTS_topk
  }